ЛИС2/src/Catalogs/лис_Лаборатории/лис_Лаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>лис_Лаборатории</name>
  <owners>Catalog.Организации</owners>
  <tabularSections>
    <name>ПереченьМетодикИзмерения</name>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МетодикаИзмерения</name>
      <type>
        <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Catalogs/лис_Лаборатории/ManagerModule.bsl
Функция СформироватьТабДокНормативныхДокументов(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Справочники.лис_Лаборатории.ПолучитьМакет("ПереченьНД");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ЛабораторииПереченьМетодикИзмерения.НомерСтроки КАК Номер,
	|	лис_ЛабораторииПереченьМетодикИзмерения.РегистрационныйНомер,
	|	лис_ЛабораторииПереченьМетодикИзмерения.МетодикаИзмерения.ПолноеНаименование КАК НаименованиеДокумента,
	|	лис_ЛабораторииПереченьМетодикИзмерения.МетодикаИзмерения.Представление КАК МетодикаКраткое
	|ИЗ
	|	Справочник.лис_Лаборатории.ПереченьМетодикИзмерения КАК лис_ЛабораторииПереченьМетодикИзмерения
	|ГДЕ
	|	лис_ЛабораторииПереченьМетодикИзмерения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		Если НЕ ТабДок.ПроверитьВывод(ОбластьСтрока) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	Возврат ТабДок;
		
КонецФункции

Функция СформироватьТабДокПеречняСИ(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Лаборатория = МассивОбъектов[0];
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование,
	|	ЛабораторноеОборудованиеВЭксплуатации.РегистрационныйНомер КАК РегНомер,
	|	ЛабораторноеОборудованиеВЭксплуатации.ИнвентарныйНомер,
	|	ЛабораторноеОборудованиеВЭксплуатации.ЗаводскойНомер,
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование.Наименование КАК НаименованиеСИ,
	|	ЛабораторноеОборудованиеВЭксплуатации.ДатаВводаВЭксплуатацию КАК ГодВводаВЭксплуатацию,
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование.Изготовитель КАК Организация,
	|	ЛабораторноеОборудованиеВЭксплуатации.ДатаИзготовления КАК ГодВыпуска,
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование.Тип КАК Тип,
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование.Изготовитель.Страна КАК Страна,
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование.КлассТочности КАК КлассТочности,
	|	ЛабораторноеОборудованиеВЭксплуатации.Лаборатория КАК МестоХранения,
	|	ЛабораторноеОборудованиеВЭксплуатации.Оборудование.Погрешность КАК Погрешность
	|ИЗ
	|	РегистрСведений.ЛабораторноеОборудованиеВЭксплуатации КАК ЛабораторноеОборудованиеВЭксплуатации
	|ГДЕ
	|	ЛабораторноеОборудованиеВЭксплуатации.Организация = &Организация
	|	И ЛабораторноеОборудованиеВЭксплуатации.Лаборатория = &Лаборатория";
	
	Запрос.УстановитьПараметр("Организация", Лаборатория.Владелец);
	Запрос.УстановитьПараметр("Лаборатория", Лаборатория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Справочники.лис_Лаборатории.ПолучитьМакет("СведенияОбОснащенностиСредствамиИзмерений");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьМакета);
	
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Номер = НомерСтроки;
		
		ТабДок.Вывести(ОбластьМакета);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;	
	
	Возврат ТабДок;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПереченьНД") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПереченьНД", "Перечень нормативных документов",
					СформироватьТабДокНормативныхДокументов(МассивОбъектов, ОбъектыПечати), , "Справочник.лис_Лаборатории.ПереченьНД");
					
	Иначе
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОбОснащенностиСредствамиИзмерений", "Сведения об оснащенности средствами измерений",
					СформироватьТабДокПеречняСИ(МассивОбъектов, ОбъектыПечати), , "Справочник.лис_Лаборатории.СведенияОбОснащенностиСредствамиИзмерений");
		
	КонецЕсли;
	
	
	
КонецПроцедуры
